## Merging and Joining a Dataframe

### Merge the given data frames by 'ID' and 'Subject'

In [4]:
df1 = pd.DataFrame({
   'ID':[101,102,103,104,105],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'Subject':['Maths','English','Science','German','History']})
print(df1)
df2 = pd.DataFrame(
   {'ID':[101,102,103,104,105],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'Subject':['English','Science','Social Science','German','History']})
print(df2)

    ID    Name  Subject
0  101    Alex    Maths
1  102     Amy  English
2  103   Allen  Science
3  104   Alice   German
4  105  Ayoung  History
    ID   Name         Subject
0  101  Billy         English
1  102  Brian         Science
2  103   Bran  Social Science
3  104  Bryce          German
4  105  Betty         History

In [7]:
import pandas as pd
# Write the code here
pd.merge(df1 , df2    , on= ['ID','Subject'])

    ID  Name_x  Subject Name_y
0  104   Alice   German  Bryce
1  105  Ayoung  History  Betty

## Join

### Write a code to JOIN(inner) data1 & data2 as data11.

In [10]:
data1 = pd.DataFrame({'SALARY_YEAR1': ['1000', '2000', '3000', '4000'],
                     'SALARY_YEAR2': ['2000', '4000', '6000', '8000']},
                    index= ['2101', '2102', '2103', '2104'])
   
data2 = pd.DataFrame({'SALARY_YEAR3': ['3000', '6000', '12000', '16000'],
                          'SALARY_YEAR4': ['4000', '8000', '15000', '30000']},
                      index= ['2101', '2106', '2103', '2104'])

In [13]:
# Write the code here
data11 = pd.concat([data1 , data2] ,join='inner')
print(data11)

Empty DataFrame
Columns: []
Index: [2101, 2102, 2103, 2104, 2101, 2106, 2103, 2104]

In [15]:
import seaborn as sns

tips = sns.load_dataset('tips')
tips.head(4)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2

In [18]:
tips_bill = tips.groupby(['sex','smoker'])[['total_bill','tip']].sum()
tips_tip = tips.groupby(['sex','smoker'])[['total_bill','tip']].sum()
del tips_bill['tip']
del tips_tip['total_bill']

In [19]:
tips_bill

               total_bill
sex    smoker
Male   Yes        1337.07
       No         1919.75
Female Yes         593.27
       No          977.68

In [20]:
tips_tip

                  tip
sex    smoker
Male   Yes     183.07
       No      302.00
Female Yes      96.74
       No      149.77

In [21]:
pd.merge?

In [23]:
pd.merge(tips_bill , tips_tip,right_index=True , left_index = True)

               total_bill     tip
sex    smoker
Male   Yes        1337.07  183.07
       No         1919.75  302.00
Female Yes         593.27   96.74
       No          977.68  149.77

In [25]:
pd.merge(
tips_bill.reset_index(),
tips_tip.reset_index(),
on=['sex','smoker'])

      sex smoker  total_bill     tip
0    Male    Yes     1337.07  183.07
1    Male     No     1919.75  302.00
2  Female    Yes      593.27   96.74
3  Female     No      977.68  149.77